module.exports.colorCodes = [
    [['аквамарин'], '7fffd4'],
    [['алый', 'алого', 'аленьк', 'алую', 'алой', 'алая', 'алым', 'алые'], 'ff2400'],
    [['аметист'], '9966cc'],
    [['антрацит'], '464451'],
    [['бежев'], 'f5f5dc'],
    [['бел'], 'ffffff'],
    [['бирюзов'], '00ffff'],
    [['бордо'], '9b2d30'],
    [['бронзов'], 'cd7f32'],
    [['бурый', 'бурого', 'бурую', 'бурая', 'бурой', 'бурым', 'бурые'], '45161c'],
    [['голуб'], '42aaff'],
    [['гранатов'], 'f34723'],
    [['желт', 'жёлт'], 'ffff00'],
    [['зелен', 'зелён'], '008000'],
    [['золот'], 'ffd700'],
    [['изумруд'], '009b77'],
    [['индиго'], '4b0082'],
    [['коричнев'], '964b00'],
    [['красн'], 'ff0000'],
    [['лайм'], '00ff00'],
    [['лилов'], 'db7093'],
    [['лимон'], 'fde910'],
    [['малахит'], '0bda51'],
    [['малинов'], 'dc143c'],
    [['мандарин'], 'ff8800'],
    [['небесн'], '7fc7ff'],
    [['нефрит'], '00a86b'],
    [['оливков'], '808000'],
    [['оранж'], 'ffa500'],
    [['охра', 'охры'], 'cc7722'],
    [['персик'], 'ffe5b4'],
    [['песочн'], 'fcdd76'],
    [['пурпурн'], '800080'],
    [['розов'], 'ffc0cb'],
    [['рыж'], 'd77d31'],
    [['салат'], '99ff99'],
    [['сапфир'], '082567'],
    [['серебр'], 'c0c0c0'],
    [['син'], '0000ff'],
    [['сиренев'], 'ff00ff'],
    [['скарлет'], 'fc2847'],
    [['сливов'], '660066'],
    [['терракот'], 'cc4e5c'],
    [['тициан'], 'd53e07'],
    [['томат'], 'ff6347'],
    [['трав'], '5da130'],
    [['ультрамарин'], '120a8f'],
    [['фиалк'], 'ea8df7'],
    [['фиолетов'], '8b00ff'],
    [['хаки'], '806b2a'],
    [['шафран'], 'f4c430'],
    [['янтар'], 'ffbf00'],
];

module.exports.colorsNum = 24;
module.exports.ledsNum = 130;

module.exports.kwRainbow = ['радуг', 'радужн', 'разноцветн'];
module.exports.kwBlack = ['черн', 'чёрн'];
module.exports.kwFast = ['быстр', 'резк'];
module.exports.kwMedium = ['средн'];
module.exports.kwSlow = ['медлен', 'плавн'];
module.exports.kwGradient = ['градиент', 'перелив'];
module.exports.kwNonGradient = ['дискрет', 'прерыв', 'пунктир'];
module.exports.kwNoise = ['шум', 'микс'];
module.exports.kwStatic = ['статич', 'статик', 'неподвижн'];
module.exports.kwFill = ['заполн', 'запомн', 'одиночн'];

module.exports.kwFull = [
    'полностью',
    'всю',
    'весь',
    'вся',
    'всей',
    'целиком',
    'целой',
    'целую',
    'целый',
];

module.exports.kwRandom = [
    'случайн',
    'перемеш',
    'вперемеш',
    'хаотич',
    'рандом',
    'вразнобой',
    'разнобой',
    'разброс',
    'вразброс',
    'беспоряд',
];

module.exports.kwNonRandom = [
    'упорядоч',
    'поряд',
    'очеред',
    'поочеред',
];